Тест_ЗУП_31_КОРП/src/Catalogs/МероприятияАдаптацииУвольнения/МероприятияАдаптацииУвольнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МероприятияАдаптацииУвольнения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняетсяСотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СдвигСрокаНачалаИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СдвигСрокаОкончанияИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятийАдаптацииУвольнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <comment>Помещено в архив</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>События</name>
    <attributes>
      <name>ВидСобытия</name>
      <type>
        <types>EnumRef.ВидыСобытийАдаптацииУвольнения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/МероприятияАдаптацииУвольнения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ

Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МероприятияАдаптацииУвольнения.Ссылка
	|ИЗ
	|	Справочник.МероприятияАдаптацииУвольнения КАК МероприятияАдаптацииУвольнения";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Справочники.МероприятияАдаптацииУвольнения.ПолучитьМакет("МероприятияАдаптацииУвольнения");
	ТаблицаМероприятий = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ТекстовыйДокумент.ПолучитьТекст()).Данные;
	
	Для Каждого СтрокаМероприятия Из ТаблицаМероприятий Цикл
		
		Наименование = СтрокаМероприятия.Name;
		ИмяВидаМероприятия = СтрокаМероприятия.TypeOfActivity;
		ВидыСобытийСтрокой = СтрокаМероприятия.EventTypes;
		ИменаВидовСобытий = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВидыСобытийСтрокой, ",");
		
		СправочникОбъект = Справочники.МероприятияАдаптацииУвольнения.СоздатьЭлемент();
		СправочникОбъект.Наименование = Наименование;
		СправочникОбъект.ИсполняетсяСотрудником = ЗначениеЗаполнено(СтрокаМероприятия.PerformedPersonally);
		
		Если Не ПустаяСтрока(ИмяВидаМероприятия) Тогда
			СправочникОбъект.ВидМероприятия = Перечисления.ВидыМероприятийАдаптацииУвольнения[ИмяВидаМероприятия];
		КонецЕсли;
		
		Для Каждого ИмяВидаСобытия Из ИменаВидовСобытий Цикл
			
			Если Не ПустаяСтрока(ИмяВидаСобытия) Тогда
				НоваяСтрока = СправочникОбъект.События.Добавить();
				НоваяСтрока.ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения[ИмяВидаСобытия];
			КонецЕсли;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
